Creating tables in SQL
---------------------

Before we actually get into basic SQL queries (**asking questions _of_ data in tables**), we'll look at some of the basics about how to **create** tables.

**NOTE: Make sure to have a copy of the database file, "dataset_1.db", from the last lecture downloaded and in this directory for the below to work!**

In [2]:
%load_ext sql
%sql sqlite:///dataset_1.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @dataset_1.db'

Activity 3:
------------

Schemas & table creation

Recall that the database we just loaded has one table, `precipitation_full`, having the following schema:

> * `state_code`
> * `station_id`
> * `year`
> * `month`
> * `day`
> * `hour`
> * `precipitation`
> * `flag_1`
> * `flag_2`

Each tuple in this table describes one hour of rainfall (`precipitation`- in hundredths of an inch) at one station (`station_id`) in one state (`state_code`).  Note that tuples with `hour=25` record the total rainfall for that day, and that we can ignore the values of attributes `flag_1` and `flag_2` for now.

Now, however, let's see how to view the **schema** of existing tables on your own; there are several ways, including but not limited to:
* DESCRIBE tablename
* SHOW CREATE TABLE tablename
* SHOW COLUMNS tablename

Unfortunately, support for these varies widely between DBMSs, and is also limited by our IPython interface (for example sqlite, which we are using, does not support the above; it does have a `.schema tablename` command, however this doesn't work in IPython notebooks...)

One that does work for us here though is:

In [3]:
%sql PRAGMA table_info(precipitation_full);

 * sqlite:///dataset_1.db
Done.

[(0, 'state_code', 'INT', 0, None, 0),
 (1, 'station_id', 'INT', 0, None, 0),
 (2, 'year', 'INT', 0, None, 0),
 (3, 'month', 'INT', 0, None, 0),
 (4, 'day', 'INT', 0, None, 0),
 (5, 'hour', 'INT', 0, None, 0),
 (6, 'precipitation', 'INT', 0, None, 0),
 (7, 'flag_1', 'VARCHAR(1)', 0, None, 0),
 (8, 'flag_2', 'VARCHAR(1)', 0, None, 0)]

A bit verbose, but gets the job done!

And, we can get the exact statement used to create the table as follows (**a great way to find guidance here!!**):

In [4]:
%sql SELECT sql FROM sqlite_master WHERE name = 'precipitation_full';

 * sqlite:///dataset_1.db
Done.

[('CREATE TABLE precipitation_full(state_code INT, station_id INT, year INT, month INT, day INT, hour INT, precipitation INT, flag_1 VARCHAR(1), flag_2 VARCHAR(1))',)]

Without going into full detail (yet), the above table contains one record for each hour at each station, and contains the amount of precipitation that was measured during that hour.

Suppose that we have been repurposed as a rain measurement corps to assist with the department that collected this data!  Based on what we've covered so far, the above example, and the internet, create a table for storing the staff assignments.  Table requirements:
* Everyone in the class will be holding a cup in the rain for a specific several-hour shift at a specific station; this assignment will remain the same every day
* Each person will have one off-day per week
* Each person's cup might be of a different size, measured as a float value
* The Dept. of Interior data servers can't handle the full dataset we would generate, and require a random subsample- so some people will be randomly chosen to stand in the rain without a cup.  These assignments need to be recorded somehow in the table too.
* Some people in the class have Umlauts in their names

Type your create table statement here:

In [25]:
%sql CREATE TABLE if not exists staff_assignement (measurement_nr INT NOT NULL, name VARCHAR(50), staff_ID INT, shift_length INT, station_id INT, cup_size FLOAT DEFAULT 0, cup BOOLEAN, precipitation INT DEFAULT 0);

 * sqlite:///dataset_1.db
(sqlite3.OperationalError) database is locked
[SQL: CREATE TABLE if not exists staff_assignement (measurement_nr INT NOT NULL, name VARCHAR(50), staff_ID INT, shift_length INT, station_id INT, cup_size FLOAT DEFAULT 0, cup BOOLEAN, precipitation INT DEFAULT 0);]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [ ]:
# urf-8 default in SQLite3
# Test:

In [23]:
%sql insert into staff_assignement \
values (234, "Möllä", 89, 9, 42, 42, true, 90)

 * sqlite:///dataset_1.db
(sqlite3.OperationalError) no such table: staff_assignement
[SQL: insert into staff_assignement  values (234, "Möllä", 89, 9, 42, 42, true, 90)]
(Background on this error at: http://sqlalche.me/e/13/e3q8)

In [24]:
%sql select * from staff_assignment

 * sqlite:///dataset_1.db
(sqlite3.OperationalError) no such table: staff_assignment
[SQL: select * from staff_assignment]
(Background on this error at: http://sqlalche.me/e/13/e3q8)